{
  "items": [
    {
      "id": 7,
      "name": "LIVID 스터디 참여",
      "agency": "SQL 튜닝 스터디",
      "date": "2024.04.06 ~ 2024.06.29(진행중)",
      "work": [
        "기본적인 API를 구현하는 방법을 넘어서 API를 더 발전시키기 위해서는 SQL 튜닝이 지식이 필요하다고 생각하여 참여하게 되었습니다.",
        "'친절한 SQL 튜닝' 도서를 기반으로 학습을 진행하고 있습니다."
      ]
    },
    {
      "id": 6,
      "name": "[5기] 프로그래머스 데브코스: 클라우드 기반 백엔드 엔지니어링 참여",
      "agency": "(주)그렙",
      "date": "2023.09.19 ~ 2024.03.25(6개월)",
      "work": [
        "프레임워크 없이 Java 언어로만 도서 관리 시스템을 구현하여 OOP, Spring Framework Core 기술에 대한 이해를 향상시켰습니다.",
        "Spring MVC 구조로 바우처 관리 시스템 만들기 프로젝트를 페어 프로그래밍으로 진행했습니다. 초반에는 Web 기능 없이 CLI 애플리케이션을 구현한 후, Web 기능(ThymeLeaf, REST API 등)을 추가하여 Web 애플리케이션으로 전환하면서 OOP에 대해 더욱 이해할 수 있었습니다.",
        "JPA를 이용해 게시판 시스템 만들기 프로젝트를 페어 프로그래밍으로 진행. JPA를 이용하여 CRUD 기능 구현하면서 기존 JDBC, JDBC Template, MyBatis와 비교하며 JPA의 장점을 이해할 수 있었습니다.",
        "SpringSecurity 미션을 통해 FilterChainProxy를 중심으로 Spring Security 구조를 이해할 수 있었습니다.",
        "2명 이상의 페어 프로그래밍으로 Short-URL 서비스를 구현하면서 Redirect와 Forward의 차이점을 이해하고, URL 단축 알고리즘에 대해 접해보고 이해할 수 있었습니다.",
        "'Spring Boot와 Spring Framework: DataSource 설정으로 알아보는 Auto Configuration 원리'를 주제로 블로그에 탐구 내용을 정리 후, 발표를 진행했습니다."
      ]
    },
    {
      "id": 5,
      "name": "말코리즘 스터디 참여",
      "agency": "Java 자료구조/알고리즘 스터디",
      "date": "2023.11.30 ~ 2024.03.25(4개월)",
      "work": [
        "'자바 알고리즘 인터뷰 with 코틀린' 도서를 기반으로 Java 알고리즘 개념을 학습했습니다.",
        "'이진 검색(Binary Search)' 파트 스터디장을 맡아 이진 검색에 대한 개념과 문제를 팀원들에게 공유했습니다."
      ]
    },
    {
      "id": 3,
      "name": "MeetCoder 블로그 포스팅 11기 참여",
      "agency": "블로그 포스팅 스터디",
      "date": "2023.11.04 ~ 2023.11.25(1개월)",
      "work": [
        "주 1회 이상 블로그 포스팅을 통해 총 4개 기술 블로그를 포스팅했습니다.",
        "'우리는 NAVER를 접속할 때 도메인 네임만 알고 있다.'라는 제목의 글을 작성하고 ARP 개념을 중심으로 발표했습니다. 이를 준비하면서 MAC 주소와 IP 주소의 차이점을 더욱 이해할 수 있었습니다."
      ]
    },
    {
      "id": 1,
      "name": "KOBOT 11기(보드팀) 참여",
      "agency": "국민대학교 임베디드 SW 학술 동아리",
      "date": "2021.11. ~ 2022.12.(1년 2개월)",
      "work": [
        "한국장학재단 동계 온라인 재능봉사 캠프(풍양초등학교, 엔트리 교육) 부팀장 역할로 참여했습니다.",
        "인트인 4차산업혁명 공모전 아이디어 분야(메타버스)에 참가했습니다.",
        "제 16회 공개 SW 개발자 대회 참가 및 본선 진출하여 우수작으로 선정되었습니다.",
        "제 20회 임베디드 SW 경진대회 참가하여 최우수상을 수상했습니다."
      ]
    }
  ]
}
